{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"16d1798f-5b35-56dd-93be-69fb4d624899","excerpt":"I published my first website in 2007. I’ve made many failed attempts to write since then,   however, this time I have a slightly different purpose and…","html":"<p>I published my first website in 2007. I’ve made many failed attempts to write since then,   however, this time I have a slightly different purpose and motivation.</p>\n<p>I began my professional career 6 years ago with great enthusiasm and incredible motivation. My goal was to be part of very good teams, so I was trying to take every opportunity. But as a result of the wrong decisions that I took, my motivation was broken. I don’t want to talk about these parts because I don’t want to blame anyone.</p>\n<p>In the 3rd year of my career, I started to think that I could not improve myself on the team. I was thinking that I needed to join a good team as a junior developer so I could find an opportunity to improve myself.  I started to look for positions that would suit me in good companies. I have been into interviews with 1-2 companies and got offers but I refused them. In the future, I might write different articles about my experiences there. In a nutshell, I could only participate as a junior in good software teams, but the main problem was that good software teams didn’t really look for a junior.  The companies which were looking for a junior, offered below the minimum wage salary, although at the time I was earning twice the minimum wage. I was looking for a team which I could get a decent salary and improve myself. At that time, I saw Netsparker’s job advertisement for a QA.</p>\n<p>Netsparker was a company I had been following for a long time. I was not suitable for Netsparker developer position. Good knowledge of English was required and I knew English at a very basic level at that time. QA was a career I didn’t plan to do in the long term, but I didn’t need to know English for the QA position. I was sure that this company could add something to me and I submitted an application. After working as a developer for 3 years, I worked as a QA for 3 years too. I’m still working as a QA in Netsparker. This company helped me improve myself. If I can write this post in English, the reason is Netsparker.</p>\n<p>I did not aim for a career in this position before starting to work in the QA position. My goal has always been to become a good developer. Since I lost a lot of motivation in the first 3 years of my career, it took a while to recover. And now I feel ready. I will try once again to be a good software developer.</p>\n<p>I do not want to be misunderstood. Of course, I am happy with the QA position and Netsparker and I think I’m doing my job well. But I don’t see a future in this position for me. That’s why I want to continue working to reach my dream job.</p>\n<p>You might think “What does this have to do with this blog?” My goal is to develop my English language skills by writing an English blog and prove that I do not have any problems with English. In addition, I will focus on my missing points at technical things This will be a long process for me, but when we look back after a year, we will be able to see how much progress I have made and what I have learned. Throughout this process, I will try to use my Github profile more actively.</p>","frontmatter":{"title":"Here We Go Again","date":"May 28, 2015","description":"This is a custom description for SEO and Open Graph purposes, rather than the default generated excerpt. Simply add a description field to the frontmatter."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/here-we-go-again/","previous":{"fields":{"slug":"/my-second-post/"},"frontmatter":{"title":"My Second Post!"}},"next":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}}}}